<template>
  <div>
    <div class="w-100 mb-5">
      <div class="notQR">
        <div
          class="notQRBox"
          style="border: 1px solid #5c5c5c;
                 overflow: auto;
                 width: calc(100% -40px);
                 margin: 20px auto;
                 background: #fff;
                 border-top: 4px solid #2e77ef !important;
                 box-shadow: 0px 2px 16px -4px rgba(0,0,0,0.2);"
        >
          <div class=" p-4 font-weight-bold" style="height: 10%">
            <div class="d-flex">
              <router-link to="/notInfoQR">
                <img
                  class="backimg"
                  src="https://www.flaticon.com/svg/static/icons/svg/61/61022.svg"
                  alt=""
                />
              </router-link>
              <p class="ml-3">{{ $t("개인정보보호정책") }}</p>
            </div>
            <hr />
          </div>
          <div class="show" style="width: 80%; margin: 0 auto;">
            <div class="mt-4 pt-4">
              <p class="LawInfo">
                본 개인정보취급방침은 본 방침이 게시된 웹사이트에서 제공되거나
                수집되는 정보의 처리에 대해 설명합니다. 또한, 타사 웹사이트 또는
                플랫폼에 있는 회사의 애플리케이션을 사용함으로써 제공되거나
                수집되는 정보의 처리에 대해 설명합니다.
                <br />
                <br />
                회사는 이용자의 개인정보를 중요시하며, 개인정보취급방침을 통하여
                회사가 이용자로부터 제공받은 개인정보를 어떠한 용도와 방식으로
                이용하고 있으며, 개인정보 보호를 위해 어떠한 조치를 취하고
                있는지 알려드립니다.
                <br />
                <br />
                1. 수집하는 정보 및 수집방법
                <br />
                회사가 수집하는 개인정보의 항목은 다음과 같습니다.
                <br />
                회사는 이용자가 직접 제공하는 정보를 수집할 수 있습니다.
                <br />
                - 이용자의 응급의료정보 등 회사는 이용자가 직접 제공하는 정보
                이외에도, 이용자가 회사의 서비스를 사용하는 과정에서 정보를
                수집할 수 있습니다.
                <br />
                - 기기정보, 로그정보,위치정보, 기타정보 등 회사는 이용자의
                정보를 다음과 같은 방법으로 수집합니다.
                <br />
                - 웹페이지 등
                <br />
                <br />
                2. 수집한 정보의 이용
                <br />
                회사는 수집한 이용자의 정보를 다음과 같은 목적으로 이용합니다.
                <br />
                - 기존서비스 개선, 신규서비스 개발 등
                <br />
                - 회원의 서비스 이용에 대한 통계, 통계학적 특성에 따른 서비스
                제공 및 광고 게재
                <br />
                - 준거법 또는 법적 의무의 준수 본 개인정보취급방침에 명시된
                목적과 다른 용도로 정보를 이용할 경우, 회사는 이용자의 동의를
                구하도록 하겠습니다.
                <br />
                <br />
                3. 수집한 정보의 공유
                <br />
                회사는 다음의 경우를 제외하고 이용자의 개인정보를 제3자에게
                공유하지 않습니다.
                <br />
                - 회사의 계열사, 파트너, 서비스 제공업체에 대한 공유
                <br />
                - 이용자가 사전에 동의하는 경우
                <br />
                - 법률상 필요한 경우
                <br />
                <br />
                4. 쿠키, 비콘 및 기타(Cookies, Beacons and Similar Technologies)
                <br />
                회사는 '쿠키(cookies)' 또는 '웹 비콘(web beacons)' 등을 통하여
                비개인적인 집합정보를 수집할 수 있습니다. 쿠키란 회사의
                웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에 보내는
                아주 작은 텍스트 파일로, 이용자의 컴퓨터 하드디스크에
                저장됩니다.
                <br />
                웹 비콘은 웹사이트 또는 이메일 상에 있는 소량의 코드입니다. 웹
                비콘을 사용하여 이용자가 특정 웹이나 이메일 콘텐츠와 상호
                작용했는지 여부를 알 수 있습니다.
                <br />
                이러한 기능은 서비스를 평가하고 개선하여 이용자 경험을 맞춤
                설정하는 데 유용하게 이용되어, 이용자에게 더 향상된 서비스를
                제공합니다.
                <br />
                회사가 수집하는 쿠키의 항목 및 수집 목적은 다음과 같습니다. -
                기존입력정보 등
                <br />
                - 이용자 편의성 증대
                <br />
                이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서
                웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나,
                쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을
                거부할 수도 있습니다. 단, 이용자께서 쿠키 설치를 거부하였을 경우
                회사가 제공하는 일부 서비스에 어려움이 있을 수 있습니다.
                <br />
                <br />
                5. 이용자의 접근 권한과 선택권
                <br />
                이용자 또는 법정대리인은 정보의 주체로서 회사의 개인정보 수집,
                사용, 공유와 관련하여 다음과 같은 선택권을 행사할 수 있습니다.
                <br />
                - 개인정보에 대한 접근권한
                <br />
                - 개인정보의 정정 또는 삭제
                <br />
                - 개인정보 처리의 일시 정지
                <br />
                - 기존에 제공한 동의의 철회의 요청
                <br />
                <br />
                6. 보안
                <br />
                회사는 이용자의 개인정보에 대한 보안을 매우 중요하게 생각합니다.
                회사는 이용자 개인정보의 무단 접근, 공개, 사용 및 수정을 막기
                위해 보안 조치를 구축하고 있습니다.
                <br />
                <br />
                7. 개인정보취급방침의 변경
                <br />
                회사는 회사의 본 방침을 수시로 수정 내지 변경할 권리를
                보유합니다. 회사가 본 방침을 변경하는 경우 웹사이트 공지사항을
                통하여 공지하며, 관계법에서 요구하는 경우에는 이용자의 동의를
                구하게 됩니다.
                <br />
                <br />
                8. 회사 담당부서
                <br />
                회사는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만을
                처리하기 위하여 아래와 같이 관련 부서를 지정하고 있습니다. 본
                방침에 대하여 의문 사항 있거나 회사가 보유한 이용자의 정보를
                업데이트하고자 하는 경우, 아래 연락처로 회사에 연락하시기
                바랍니다.
                <br />
                - 이메일 : sequence9shop@gmail.com
                <br />
                최종갱신일: 2021년 3월 1일
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  beforeMount() {
    this.$store.state.Navbar.Toggle = "d-none";
  },
};
</script>

<style scoped>
.backimg {
  width: 25px;
  height: 25px;
}
.LawInfo {
  font-size: 14px;
  color: #555555;
  font-weight: 400;
}
.Visible {
  display: none !important;
}
</style>
