<template>
  <div>
    <div class="w-100 mb-5">
      <div class="notQR">
        <div
          class="notQRBox"
          style="border: 1px solid #5c5c5c;
                 overflow: auto;
                 width: calc(100% -40px);
                 margin: 20px auto;
                 background: #fff;
                 border-top: 4px solid #2e77ef !important;
                 box-shadow: 0px 2px 16px -4px rgba(0,0,0,0.2);"
        >
          <div class=" p-4 font-weight-bold" style="height: 10%">
            <div class="d-flex">
              <router-link to="/notInfoQR">
                <img
                  class="backimg"
                  src="https://www.flaticon.com/svg/static/icons/svg/61/61022.svg"
                  alt=""
                />
              </router-link>
              <!-- <p class="ml-3">{{ $t("개인정보보호정책") }}</p> -->
              <p class="ml-3">個人情報保護ポリシー</p>
            </div>
            <hr />
          </div>
          <div class="show" style="width: 80%; margin: 0 auto;">
            <div class="mt-4 pt-4">
              <p class="LawInfo">
                個人情報取扱方針
                <br />
                本個人情報取扱方針は、本方針が掲示されたウェブサイトで提供されたり、収集される情報の処理について説明します。
                また、他社のウェブサイト又はプラットフォームにある会社のアプリケーションを使用することにより、提供され、又は収集される情報の処理について説明します。
                <br />
                <br />
                会社は、利用者の個人情報を重視し、個人情報取扱方針を通じて会社が利用者から提供を受けた個人情報をどのような用途と方法で利用しており、個人情報保護のためにどのような措置を取っているかお知らせいたします。
                <br />
                <br />
                本方針は、2021年3月1日から施行され、これを改定する場合、ウェブサイト上のお知らせ事項を通じて告知します。
                <br />
                <br />
                1. 収集する情報及び収集方法
                <br />
                会社が収集する個人情報の項目は次のとおりです。
                <br />
                会社は利用者が直接提供する情報を収集することができます。
                <br />
                - 利用者の応急医療情報など
                <br />
                会社は、利用者が直接提供する情報以外にも利用者が会社のサービスを使用する過程で、情報を収集することができます。
                <br />
                - 機器情報、ログ情報、位置情報、その他情報など
                <br />
                会社は利用者の情報を次のような方法により収集します。
                <br />
                - ウェブページなど
                <br />
                <br />
                2. 収集した情報の利用
                <br />
                会社は収集した利用者の情報を以下の目的で利用します。
                <br />
                - 既存サービスの改善、新規サービスの開発など
                <br />
                -
                会員のサービス利用に対する統計、統計学的特性によるサービス提供及び広告掲載
                <br />
                - 準拠法または法的義務の遵守
                <br />
                本個人情報取扱方針に明示された目的と異なる用途で情報を利用する場合、会社は利用者の同意を求めることにします。
                <br />
                <br />
                3. 収集した情報の共有
                <br />
                会社は以下の場合を除き、利用者の個人情報を第三者に共有しません。
                <br />
                - 会社の系列会社、パートナー、サービス提供会社に対する共有
                <br />
                - 利用者が事前に同意する場合
                <br />
                - 法律上必要な場合
                <br />
                <br />
                4. クッキー、ビーコン及びその他(Cookies, Beacons and Similar
                Technologies)
                <br />
                会社は「クッキー(cookies)」または「ウェブビーコン(web
                beacons)」などを通じて非個人的な集合情報を収集することができます。
                <br />
                クッキーとは会社のウェブサイトを運営するのに利用されるサーバーが利用者のブラウザに送る非常に小さなテキストファイルで、利用者のコンピュータのハードディスクに保存されます。
                <br />
                ウェブビーコンは、ウェブサイトまたはメール上にある少量のコードです。
                ウェブビーコンを使用して、利用者が特定のウェブや電子メールコンテンツと相互作用したかどうかを確認することができます。
                <br />
                会社が収集するクッキーの項目及び収集目的は、次のとおりです。
                <br />
                - 既存の入力情報など
                <br />
                - 利用者の利便性の増大
                <br />
                利用者はクッキーのインストールに対する選択権を持っています。
                したがってウェブブラウザでオプションを設定することで全てのクッキーを許可したり、クッキーが保存される度に確認を経たり、全てのクッキーの保存を拒否することもできます。
                ただし、利用者がクッキーのインストールを拒否した場合、会社が提供する一部のサービスにおいて困難が生じることがあります。
                <br />
                <br />
                5. 利用者のアクセス権限と選択権
                <br />
                利用者又は法定代理人は、情報の主体として会社の個人情報の収集、使用、共有に関連し、次のような選択権を行使することができます。
                <br />
                - 個人情報に対するアクセス権限
                <br />
                - 個人情報の訂正または削除
                <br />
                - 個人情報の処理の一時停止
                <br />
                - 既存提供した同意の撤回の要請
                <br />
                <br />
                6. 保安
                <br />
                会社は利用者の個人情報に対するセキュリティを非常に重要に考えています。
                会社は、利用者個人情報の無断アクセス、公開、使用及び修正を防ぐため、セキュリティ措置を構築しています。
                <br />
                <br />
                7. 個人情報取扱方針の変更
                <br />
                会社は、会社の本方針を随時修正·変更する権利を有します。
                会社が本方針を変更する場合、ウェブサイトのお知らせ事項を通じてお知らせし、関連法が要求する場合は、利用者の同意を求めるものとします。
                <br />
                <br />
                8. 会社担当部署
                <br />
                会社は、利用者の個人情報を保護し、個人情報に関する苦情を処理するために以下の通り関連部署を指定しています。
                本方針について不明な点があったり、会社が保有している利用者の情報をアップデートしたい場合は、以下の連絡先へ会社に連絡してください。
                <br />
                - Eメール: sequence9shop@gmail.com
                <br />
                最終更新日: 2021年3月1日
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  beforeMount() {
    this.$store.state.Navbar.Toggle = "d-none";
  },
};
</script>

<style scoped>
.backimg {
  width: 25px;
  height: 25px;
}
.LawInfo {
  font-size: 14px;
  color: #555555;
  font-weight: 400;
}
.Visible {
  display: none !important;
}
</style>
